app/Controllers/ProductosController.php

SELECT *
FROM `categoria`
SELECT *
FROM `talle`
---
    public function agregar_producto() {
          $categoria = new CategoriaModel();
          $data['categorias'] = $categoria->findAll();

          $marca = new MarcaModel();
          $data['marcas'] = $marca->findAll();

          $talle = new TalleModel();
          $data['talles'] = $talle->findAll();