app/Controllers/ProductosController.php

SELECT *
FROM `marca`
---
    public function catalogo() {
        $productoModel = new ProductosModel();
        $marcaModel = new MarcaModel();
        $categoriaModel = new CategoriaModel();
        $talleModel = new TalleModel();
        $stockModel = new StockTallesModel();

        $data['productos'] = $productoModel->findAll();
        $productos = $data['productos'];

        $marcas = $marcaModel->findAll();

SELECT *
FROM `talle`
SELECT *
FROM `stock_talles`
WHERE `producto_id` = '4'
AND `stock` > 0
---
    public function verCarrito(){
        $carrito = session()->get('carrito') ?? [];

        $stockTallesModel = new StockTallesModel();
        $talleModel = new TalleModel();

        $productosEnCarritoConDatosCompletos = [];


        $todosLosTalles = $talleModel->findAll();
        $tallesMap = [];
        foreach ($todosLosTalles as $talle) {
            $tallesMap[$talle['id_talle']] = $talle['descripcion'];
        }

        foreach ($carrito as $productoEnSesion) {
            $id_producto = $productoEnSesion['id'];

            $stocksDelProducto = $stockTallesModel
                                    ->where('producto_id', $id_producto)
                                    ->where('stock >', 0)
                                    ->findAll();